{
	"datos": [
	    {
	    	"nombre": "BIOS", 
	    	"descripcion": "El Basic Input/Output System (BIOS) o sistema básico de entrada/salida, es un estándar de facto que define la interfaz de firmware.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Bit", 
	    	"descripcion": "unidad de información más pequeña con la que pueden trabajar los dispositivos electrónicos.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Bus del Sistema", 
	    	"descripcion": "es un conjunto de cables que conecta las partes importantes del ordenador.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Chipset", 
	    	"descripcion": "Un chipset (traducido como circuito integrado auxiliar) es el conjunto de circuitos integrados diseñados con base en la arquitectura de un procesador (en algunos casos, diseñados como parte integral de esa arquitectura), permitiendo que ese tipo de procesadores funcionen en una placa base.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Datos de Salida", 
	    	"descripcion": " son datos derivados u obtenidos a partir de los datos de entrada.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora", 
	    	"descripcion": " es una máquina programable, es decir, capaz de ejecutar programas desarrollados por programadores.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "CMOS", 
	    	"descripcion": "En un dispositivo Semiconductor Complementario de Óxido Metálico que utilice lógica positiva, una señal eléctrica.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Circuito Integrado", 
	    	"descripcion": "o está formado por varios componentes miniaturizados, tales como: transistores, resistencias, condensadores, etc.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora Analógica", 
	    	"descripcion": "Es un dispositivo electrónico diseñado con el fin de manipular la entrada de datos en términos de por mencionar un ejemplo, niveles de tensión o presiones hidráulicas, en lugar de hacerlo como datos numéricos. ",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora Digital", 
	    	"descripcion": "Es aquella que cuenta directamente los números (0 dígitos) que representan numerales, letras y otros símbolos especiales. Son capaces de almacenar diferentes programas por lo que se les puede utilizar en incontables aplicaciones.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadoras Personales", 
	    	"descripcion": "tienen un tamaño adecuado para un escritorio y son las más asequibles económicamente.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Datos de Entrada", 
	    	"descripcion": "son los que la computadora va a procesar.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Estaciones de Trabajo", 
	    	"descripcion": "tienen mayores prestaciones que los PCs, y se utilizan en oficinas de trabajo.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Hardware", 
	    	"descripcion": "conjunto de componentes tangibles de una computadora.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Informática", 
	    	"descripcion": "se puede definir como una mezcla de ciencia y tecnología que estudia y posibilita el tratamiento automático y racional de la información por medio de computadoras.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "John Bardeen, Walter Houser Brattain y William Bradford Shockley", 
	    	"descripcion": "creadores del Transistor.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Jack S. Kilby", 
	    	"descripcion": "Inventor del chip.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Mainframe", 
	    	"descripcion": "es un ordenador mucho más grande y caro. Esta computadora se emplea, fundamentalmente, en centros de investigación, instituciones gubernamentales y empresas grandes.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Minicomputadoras", 
	    	"descripcion": "son de mayor potencia y tamaño que cualquier PC o estación de trabajo y, por tanto, más caras.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Periféricos", 
	    	"descripcion": "las unidades de entrada, de salida y de almacenamiento no son imprescindibles y, por esta razón, se les considera dispositivos periféricos.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Placa Base", 
	    	"descripcion": "es una tarjeta de circuito impreso a la que se conectan los componentes que constituyen la computadora.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Programa", 
	    	"descripcion": "es un conjunto de instrucciones que indican a la computadora las operaciones que ésta debe realizar con unos datos determinados.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "RAM", 
	    	"descripcion": "se utiliza como memoria de trabajo de computadoras para el sistema operativo, los programas y la mayor parte del software.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Software", 
	    	"descripcion": "al conjunto de programas y datos con los que trabaja una computadora.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Supercomputadoras", 
	    	"descripcion": "son las computadoras más grandes que existen en el mundo, capaces de realizar billones de instrucciones por segundo.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Transistor", 
	    	"descripcion": "está compuesto, fundamentalmente, de un material semiconductor, generalmente silicio, que se puede utilizar como: amplificador, interruptor y oscilador.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Unidad de almacenamiento secundario", 
	    	"descripcion": "El disco duro es el elemento más distinguido de esta unidad, que permite 'almacenar' o 'guardar', por tiempo indefinido, grandes cantidades de datos y programas.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad aritmético/lógica", 
	    	"descripcion": "(Arithmetic/Logic Unit, ALU) Esta unidad sirve para realizar cálculos aritméticos y lógicos. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de control", 
	    	"descripcion": "(Control Unit, CU). A esta unidad le corresponde interpretar las instrucciones de los programas.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de entrada", 
	    	"descripcion": "El teclado y el ratón son los dos elementos más representativos de esta unidad, que permite a la computadora 'recibir' datos de entrada desde el exterior. Otros elementos de entrada son: el escáner, el lápiz óptico, el micrófono, etc. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de memoria", 
	    	"descripcion": "En ella se puede 'almacenar', temporalmente, tanto las instrucciones de un programa como los datos de entrada y salida que éste manipule. Comúnmente, a la unidad de memoria se le conoce como memoria principal.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de salida", 
	    	"descripcion": "El monitor y la impresora son los dos dispositivos más característicos de esta unidad, que facilita a la computadora 'enviar' datos de salida hacia el exterior. Otros dispositivos de salida son: el plotter, los altavoces, etc.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad central de proceso", 
	    	"descripcion": "(Central Processing Unit, CPU). A esta unidad pertenece el procesador, que es, sin duda alguna, el componente más importante de la computadora; de él se dice que es el cerebro de la misma. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Programador", 
	    	"descripcion": "la persona que desarrolla un programa.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Usuario", 
	    	"descripcion": "hace uso de los programas.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Software de Aplicación", 
	    	"descripcion": "llamados aplicaciones de usuario o, simplemente, aplicaciones.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Sistema Operativo", 
	    	"descripcion": "Sirve de intermediario (interfaz) entre los programas y la computadora.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Software del sistema", 
	    	"descripcion": "Linux, MS-DOS, UNIX, Windows XP",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Software de red", 
	    	"descripcion": "En ella se incluyen programas relacionados con la interconexión de equipos informáticos, es decir, programas necesarios para que las redes de computadoras funcionen. ",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red informática", 
	    	"descripcion": "Está compuesta por un conjunto de equipos informáticos conectados entre sí mediante distintos elementos de conexión, tales como: cables, tarjetas de red, dispositivos inalámbricos, etc. ",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red cliente", 
	    	"descripcion": "Pueden emplear los usuarios de una red para solicitar información (datos) y servicios (impresión de documentos, transferencia de ficheros, correo electrónico,...) a los equipos servidores",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red servidor", 
	    	"descripcion": "Sirve datos a los clientes que se los pidan.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Administrador de red", 
	    	"descripcion": "Es la persona encargada de su administración",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red de área local", 
	    	"descripcion": "Los equipos están conectados a poca distancia. A ella pueden pertenecer, por ejemplo, todos los equipos de una oficina, un aula o un supermercado. En todos los casos, la configuración de los equipos puede ser cliente/servidor o igual a igual.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red igual a igual", 
	    	"descripcion": "todos los equipos pueden ser cliente y servidoral mismo tiempo, es decir, no existen equipos clientes exclusivos ni servidores dedicados.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Red de área extensa", 
	    	"descripcion": "La red que conecte a los equipos de una empresa que tiene oficinas en varias ciudades o países es una WAN.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Internet", 
	    	"descripcion": "Es una red que interconecta a millones de computadoras repartidas por todo el mundo. Para ello, se utilizan distintos medios físicos, tales como: líneas telefónicas, fibra óptica, enlaces vía satélite, ondas terrestres, etc.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Nodos", 
	    	"descripcion": "Todas las computadoras intermedias entre el servidor y el cliente",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "TCP", 
	    	"descripcion": "Transmission Control Protocol",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "IP", 
	    	"descripcion": "Internet Protocol",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "ARPA", 
	    	"descripcion": "Advanced Research Projects Agency",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "TCP/IP", 
	    	"descripcion": "Permite a todas las computadoras del mundo conectadas a Internet comunicarse entre sí, con independencia del tipo que sean o del sistema operativo que utilicen.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "World Wide Web, WWW", 
	    	"descripcion": "fue desarrollada en 1989 por el informático británico Timothy BernersLee en la Organización Europea para la Investigación Nuclear (European Organization for Nuclear Research, CERN). La WWW permite a los usuarios de Internet buscar y acceder a una gran cantidad de información multimedia (textos, imágenes, sonidos, animaciones y vídeos). ",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Intranet", 
	    	"descripcion": "Es una red interna que ofrece a todos los usuarios de dicha red los mismos servicios que Internet (correo electrónico, transferencia de ficheros, páginas web,...). Una intranet puede ser pública o privada, dependiendo de si se puede acceder a ella desde Internet o, únicamente, desde los equipos de la propia red.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Centros de datos", 
	    	"descripcion": "Se denomina centro de procesamiento de datos a aquella ubicación donde se concentran los recursos necesarios para el procesamiento de la información de una organización.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Patron Cliente/Servidor", 
	    	"descripcion": "a arquitectura cliente-servidor es un modelo de aplicación distribuida en el que las tareas se reparten entre los proveedores de recursos o servicios, llamados servidores, y los demandantes, llamados clientes.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Servidores Proxy", 
	    	"descripcion": "Un proxy, o servidor proxy, en una red informática, es un servidor (un programa o sistema informático), que hace de intermediario en las peticiones de recursos que realiza un cliente (A) a otro servidor (C).",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Direccion IP", 
	    	"descripcion": "Una dirección IP es una etiqueta numérica que identifica, de manera lógica y jerárquica, a un interfaz de un dispositivo dentro de una red que utilice el protocolo IP, que corresponde al nivel de red del Modelo OSI.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Servidores Raiz", 
	    	"descripcion": "Un servidor raíz (root server en inglés) es un servidor de nombres para la zona raíz del Sistema de nombres de dominio de Internet (DNS).1 Los servidores de nombres raíz son una parte fundamental de la Internet, ya que son el primer paso en la traducción de (resolver) los nombres de host legibles por humanos en direcciones IP que se utilizan en la comunicación entre los hosts de Internet.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Cadenas de servidores", 
	    	"descripcion": "Este término generalmente se utiliza para hacer referencia a una interacción con una base de datos. Es la parte de una URL que contiene los datos que deben pasar a aplicaciones web como los programas CGI.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "BackUp", 
	    	"descripcion": "Una copia de seguridad, copia de respaldo o backup (su nombre en inglés) en tecnologías de la información e informática es una copia de los datos originales que se realiza con el fin de disponer de un medio para recuperarlos en caso de su pérdida. Las copias de seguridad son útiles ante distintos eventos y usos: recuperar los sistemas informáticos y los datos de una catástrofe informática, natural o ataque; restaurar una pequeña cantidad de archivos que pueden haberse eliminado accidentalmente, corrompido, infectado por un virus informático u otras causas; guardar información histórica de forma más económica que los discos duros y además permitiendo el traslado a ubicaciones distintas de la de los datos originales; etc..",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Failsafe", 
	    	"descripcion": "El modo a prueba de fallos, también conocido como modo seguro, es un modo de acceso usado por ciertos sistemas operativos como Microsoft Windows, Mac OS X, Linux, y otros dispositivos electrónicos.",
	    	"color": "#1976d2"
	    },
	    {
	    	"nombre": "Informática en la nube", 
	    	"descripcion": "Conocida también como servicios en la nube, informática en la nube, nube de cómputo o nube de conceptos (del inglés cloud computing), es un paradigma que permite ofrecer servicios de computación a través de una red, que usualmente es Internet.",
	    	"color": "#1976d2"
	    }
	]
}


