{
	"datos": [
	    {
	    	"nombre": "BIOS", 
	    	"descripcion": "El Basic Input/Output System (BIOS) o sistema básico de entrada/salida, es un estándar de facto que define la interfaz de firmware.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Bit", 
	    	"descripcion": "unidad de información más pequeña con la que pueden trabajar los dispositivos electrónicos.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Bus del Sistema", 
	    	"descripcion": "es un conjunto de cables que conecta las partes importantes del ordenador.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Chipset", 
	    	"descripcion": "Un chipset (traducido como circuito integrado auxiliar) es el conjunto de circuitos integrados diseñados con base en la arquitectura de un procesador (en algunos casos, diseñados como parte integral de esa arquitectura), permitiendo que ese tipo de procesadores funcionen en una placa base.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Datos de Salida", 
	    	"descripcion": " son datos derivados u obtenidos a partir de los datos de entrada.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora", 
	    	"descripcion": " es una máquina programable, es decir, capaz de ejecutar programas desarrollados por programadores.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "CMOS", 
	    	"descripcion": "En un dispositivo Semiconductor Complementario de Óxido Metálico que utilice lógica positiva, una señal eléctrica.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Circuito Integrado", 
	    	"descripcion": "o está formado por varios componentes miniaturizados, tales como: transistores, resistencias, condensadores, etc.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora Analógica", 
	    	"descripcion": "Es un dispositivo electrónico diseñado con el fin de manipular la entrada de datos en términos de por mencionar un ejemplo, niveles de tensión o presiones hidráulicas, en lugar de hacerlo como datos numéricos. ",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadora Digital", 
	    	"descripcion": "Es aquella que cuenta directamente los números (0 dígitos) que representan numerales, letras y otros símbolos especiales. Son capaces de almacenar diferentes programas por lo que se les puede utilizar en incontables aplicaciones.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Computadoras Personales", 
	    	"descripcion": "tienen un tamaño adecuado para un escritorio y son las más asequibles económicamente.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Datos de Entrada", 
	    	"descripcion": "son los que la computadora va a procesar.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Estaciones de Trabajo", 
	    	"descripcion": "tienen mayores prestaciones que los PCs, y se utilizan en oficinas de trabajo.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Hardware", 
	    	"descripcion": "conjunto de componentes tangibles de una computadora.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Informática", 
	    	"descripcion": "se puede definir como una mezcla de ciencia y tecnología que estudia y posibilita el tratamiento automático y racional de la información por medio de computadoras.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "John Bardeen, Walter Houser Brattain y William Bradford Shockley", 
	    	"descripcion": "creadores del Transistor.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Jack S. Kilby", 
	    	"descripcion": "Inventor del chip.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Mainframe", 
	    	"descripcion": "es un ordenador mucho más grande y caro. Esta computadora se emplea, fundamentalmente, en centros de investigación, instituciones gubernamentales y empresas grandes.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Minicomputadoras", 
	    	"descripcion": "son de mayor potencia y tamaño que cualquier PC o estación de trabajo y, por tanto, más caras.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Periféricos", 
	    	"descripcion": "las unidades de entrada, de salida y de almacenamiento no son imprescindibles y, por esta razón, se les considera dispositivos periféricos.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Placa Base", 
	    	"descripcion": "es una tarjeta de circuito impreso a la que se conectan los componentes que constituyen la computadora.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Programa", 
	    	"descripcion": "es un conjunto de instrucciones que indican a la computadora las operaciones que ésta debe realizar con unos datos determinados.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "RAM", 
	    	"descripcion": "se utiliza como memoria de trabajo de computadoras para el sistema operativo, los programas y la mayor parte del software.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Software", 
	    	"descripcion": "al conjunto de programas y datos con los que trabaja una computadora.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Supercomputadoras", 
	    	"descripcion": "son las computadoras más grandes que existen en el mundo, capaces de realizar billones de instrucciones por segundo.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Transistor", 
	    	"descripcion": "está compuesto, fundamentalmente, de un material semiconductor, generalmente silicio, que se puede utilizar como: amplificador, interruptor y oscilador.",
	    	"color": "#000000"
	    },
	    {
	    	"nombre": "Unidad de almacenamiento secundario", 
	    	"descripcion": "El disco duro es el elemento más distinguido de esta unidad, que permite 'almacenar' o 'guardar', por tiempo indefinido, grandes cantidades de datos y programas.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad aritmético/lógica", 
	    	"descripcion": "(Arithmetic/Logic Unit, ALU) Esta unidad sirve para realizar cálculos aritméticos y lógicos. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de control", 
	    	"descripcion": "(Control Unit, CU). A esta unidad le corresponde interpretar las instrucciones de los programas.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de entrada", 
	    	"descripcion": "El teclado y el ratón son los dos elementos más representativos de esta unidad, que permite a la computadora 'recibir' datos de entrada desde el exterior. Otros elementos de entrada son: el escáner, el lápiz óptico, el micrófono, etc. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de memoria", 
	    	"descripcion": "En ella se puede 'almacenar', temporalmente, tanto las instrucciones de un programa como los datos de entrada y salida que éste manipule. Comúnmente, a la unidad de memoria se le conoce como memoria principal.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad de salida", 
	    	"descripcion": "El monitor y la impresora son los dos dispositivos más característicos de esta unidad, que facilita a la computadora 'enviar' datos de salida hacia el exterior. Otros dispositivos de salida son: el plotter, los altavoces, etc.",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Unidad central de proceso", 
	    	"descripcion": "(Central Processing Unit, CPU). A esta unidad pertenece el procesador, que es, sin duda alguna, el componente más importante de la computadora; de él se dice que es el cerebro de la misma. ",
	    	"color": "#CC0000"
	    },
	    {
	    	"nombre": "Programador", 
	    	"descripcion": "la persona que desarrolla un programa.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "Usuario", 
	    	"descripcion": "hace uso de los programas.",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "", 
	    	"descripcion": "",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "", 
	    	"descripcion": "",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "", 
	    	"descripcion": "",
	    	"color": "#38761d"
	    },
	    {
	    	"nombre": "", 
	    	"descripcion": "",
	    	"color": "#38761d"
	    }

	]
}


